app/controllers/home_controller.rb

SELECT * FROM `upload_files` WHERE (user_id=1) ORDER BY created_at DESC LIMIT 0, 3
SELECT count(*) AS count_all FROM `upload_files` WHERE (user_id=1)
---
  def file_upload
    user_id = current_user.id
    @user_image,@user_desc = get_twitter_avatar_bio(user_id)
    login = current_user.login
    user_id = get_user_id_by_login(login)
    @medias = UploadFile.paginate :per_page => 3,:page => params[:page], :order => 'created_at DESC', :conditions=>"user_id=#{user_id}"