app/controllers/medias_controller.rb

  def user_media
    user_id = get_user_id_by_login(params[:login])
    if user_id == 0
      flash[:rss_notice] = "There is problem access this page"
      redirect_to '/home'
    else
     # @tweets = twitter_follower_list(user_id)
     # @user_image,@user_desc = get_twitter_avatar_bio(user_id)
     @user_image = ""
     @user_desc = ""
      @user_name = get_user_name_by_id(user_id)
      @medias = UploadFile.paginate :per_page => 5,:page => params[:page], :order => 'created_at DESC', :conditions=>"user_id=#{user_id}"
---
SELECT * FROM `upload_files` WHERE (user_id=1) ORDER BY created_at DESC LIMIT 0, 5
SELECT count(*) AS count_all FROM `upload_files` WHERE (user_id=1)

  def index
    @image_type = params[:type]
    if(@image_type != "all")
     content_id = UploadFile.get_content_type(@image_type)
     @medias = UploadFile.paginate(:per_page => 5,:page => params[:page],:order =>'created_at DESC',:conditions=>["content_id=?",content_id])
---
SELECT * FROM `upload_files` WHERE (content_id=1) ORDER BY created_at DESC LIMIT 0, 5
SELECT count(*) AS count_all FROM `upload_files` WHERE (content_id=1)

  def change_asset_name
    encrypt_id = params[:encrypt_id]
    new_media_name = params[:media][:media_name]
    media_id = get_file_id_by_encrypt_id(encrypt_id)
    @file = UploadFile.find(media_id)
    @file.update_attributes(:media_name=>new_media_name)
---
SELECT id FROM `upload_files` WHERE (encrypt_id='Qe4grU7bpC') LIMIT 1
UPDATE `upload_files` SET `media_name` = 'Testing URL', `updated_at` = '2010-07-01 15:18:35' WHERE `id` = 19

  def show
      media_id = get_file_id_by_encrypt_id(params[:id])
      if media_id == 0
        # Error message display, If file is delete from DB and Drop.io
        @media_error = "Media no longer Exist"
      else
        begin
          @user_image = ""
          user_id = get_user_id_media_id(media_id)
          @user_name = get_user_name_by_id(user_id)
          # find media with id in DB
          @media_details = UploadFile.find(media_id)
          # Find asset(media) in drop.io.Pass asset name as parameter
          @media_asset = asset_find(@media_details.name,@media_details.drop_name)
          # Increase the view count
          if flash[:comment_update] != "false"
            @media_details.increment!(:view_count)
          end
          # Create comment object
          @comment = Comment.new(:id => @media_details)
          media_list(@media_details.user_id,media_id)
          @comment_list = @media_details.comments.paginate(:per_page=>5,:page => params[:page], :order => 'created_at DESC')
---
SELECT id FROM `upload_files` WHERE (encrypt_id='Qe4grU7bpC') LIMIT 1
UPDATE `upload_files` SET `view_count` = 18, `updated_at` = '2010-07-01 12:48:36' WHERE `id` = 19
SELECT * FROM `comments` WHERE (`comments`.upload_file_id = 19) ORDER BY created_at DESC, created_at DESC LIMIT 0, 5
SELECT * FROM `upload_files` WHERE (user_id=1 AND id NOT IN(19)) ORDER BY created_at DESC LIMIT 3
SELECT * FROM `users` WHERE (remember_token = 'f81cd7e86add56bdfd9f' AND remember_token_expires_at > '2010-07-01 18:18:40') LIMIT 1
SELECT count(*) AS count_all FROM `comments` WHERE (upload_file_id=19)

  def destroy
    @media = UploadFile.find(params[:id])
    # Find media(asset) name
    asset_name = @media.name
    # Media list pagination
    if params[:page].nil? or params[:page].empty?
      page_no = 0
    else
      page_no = params[:page]
    end
    page_no = page_no.to_i
    # Delete media in database
    if @media.destroy
---
SELECT * FROM `upload_files` WHERE (`upload_files`.`id` = 5)
DELETE FROM `upload_files` WHERE `id` = 5