app/controllers/rss_controller.rb

SELECT * FROM `upload_files` ORDER BY id DESC LIMIT 15
---
  def rssfeed
    @medias = UploadFile.find(:all,:order=>'id DESC',:limit=>15)
    if !@medias.nil?
      @thumbnail = Array.new
      @medias.each do |media|